/*
割り当て
重さがそれぞれ 
 の 
 個の荷物が、ベルトコンベアから順番に流れてきます。これらの荷物を 
 台のトラックに積みます。各トラックには連続する 0 個以上の荷物を積むことができますが、それらの重さの和がトラックの最大積載量 
 を超えてはなりません。最大積載量 
 はすべてのトラックで共通です。

、
、
 が与えられるので、すべての荷物を積むために必要な最大積載量 
 の最小値を求めるプログラムを作成してください。

入力
最初の行に荷物の数 
 とトラックの数 
 が空白区切りで与えられます。続く 
 行に 
 個の整数 
 がそれぞれ１行に与えられます。

出力
 の最小値を１行に出力してください。

制約
入力例 1
5 3
8
1
7
3
9
出力例 1
10
１台目のトラックに２つの荷物 
,２台目のトラックに２つの荷物 
、３台目のトラックに１つの荷物 
 を積んで、最大積載量の最小値が 10 となります。


入力例 2
4 2
1
2
2
6
出力例 2
6
１台目のトラックに３つの荷物 
,２台目のトラックに１つの荷物 
 を積んで、最大積載量の最小値が 6 となります。
*/